final List<String> planetList = [
  'முதல் பாவம்',
  'இரண்டாம் பாவம்',
  'மூன்றாம் பாவம்',
  'நான்காம் பாவம்',
  'ஐந்தாம் பாவம்',
  'ஆறாம் பாவம்',
  'ஏழாம் பாவம்',
  'எட்டாம் பாவம்',
  'ஒன்பதாம் பாவம்',
  'பத்தாம் பாவம்',
  'பதினொன்றாம் பாவம்',
  'பன்னிரண்டாம் பாவம்',
];

int sinIdFromName(String name) {
  final mapping = {
    'முதல் பாவம்': 1,
    'இரண்டாம் பாவம்': 2,
    'மூன்றாம் பாவம்': 3,
    'நான்காம் பாவம்': 4,
    'ஐந்தாம் பாவம்': 5,
    'ஆறாம் பாவம்': 6,
    'ஏழாம் பாவம்': 7,
    'எட்டாம் பாவம்': 8,
    'ஒன்பதாம் பாவம்': 9,
    'பத்தாம் பாவம்': 10,
    'பதினொன்றாம் பாவம்': 11,
    'பன்னிரண்டாம் பாவம்': 12,
  };
  return mapping[name] ?? 1;
}
